Tekla Open API Reference for Tekla Structures 2025
MaterialSelectionForm Constructor
Overload List
Name | Description
MaterialSelectionForm(List<MaterialItem>)
 Creates a new instance of the MaterialSelectionForm.
MaterialSelectionForm(List<MaterialItem>, String)
 Creates a new instance of the MaterialSelectionForm, selecting the given material in the tree control.
Top
See Also
Reference
MaterialSelectionForm Class
Tekla.Structures.Dialog.UIControls Namespace